In [1]:
import pandas as pd

## 예제 1-10 내부 원소 처리 기준

In [2]:
import numpy as np

In [6]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))

In [7]:
df_1

   A  B  C
0  8  2  4
1  2  4  7
2  5  5  6

In [8]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('CAB'))

In [9]:
df_2

   C  A  B
0  7  1  6
1  3  5  1
2  7  3  3

In [10]:
np.log(df_2)

          C         A         B
0  1.945910  0.000000  1.791759
1  1.098612  1.609438  0.000000
2  1.945910  1.098612  1.098612

In [11]:
df_1 + df_2

   A  B   C
0  9  8  11
1  7  5  10
2  8  8  13

In [12]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns=list('CB'))

In [15]:
df_3

   C  B
0  7  5
1  2  9
2  9  8

In [17]:
df_1

   A  B  C
0  8  2  4
1  2  4  7
2  5  5  6

In [14]:
df_1 + df_3

    A   B   C
0 NaN   7  11
1 NaN  13   9
2 NaN  13  15